[{"id":1,"season":"1","episode":"1","title":"Arriving in Paradise","detective":"Detective Inspector Richard Poole","victim":"Detective Inspector Charlie Hulme and James Lavender","culprit":"Sergeant Lily Thomson","cause":"Gun shot","description":"Charlie Hulme, a British detective inspector, is found murdered in a locked panic room on the Caribbean island of Saint Marie. Commissi1r Selwyn Patterson demands that a UK officer investigates Charlie's death, so DI Richard Poole flies out to Saint Marie to solve the mystery. Richard learns that Charlie was having an affair with Sarah, 1 of the residents on the island, providing Sarah's husband with a motive to murder. Richard is convinced he has solved the case, but then Sarah's husband is also murdered, forcing Richard to look deeper into the case, and search for a mysterious woman seen at the house on the day of Charlie's death.","thumbnail":"http://127.0.0.1:8090/images/dip11.png"},{"id":2,"season":"1","episode":"2","title":"Wicked Wedding Night","detective":"Detective Inspector Richard Poole","victim":"Lisa Moore","culprit":"William the butler","cause":"Shot by spear gun","description":"A bride is shot through the heart with a spear gun just minutes after getting married, in a room to which she did not have the key. Richard teams up with new sergeant Camille to work out who would want the bride dead; he learns that no 1 had entered or left the fifth floor of the hotel room during the celebrations, which leads him to believe 1 of the party guests must be the killer.","thumbnail":"http://127.0.0.1:8090/images/dip22.png"},{"id":3,"season":"1","episode":"3","title":"Predicitng Murder","detective":"Detective Inspector Richard Poole","victim":"Angelique Morel","culprit":"Angelique Morel","cause":"Suicide by poisoning","description":"Richard is inclined to believe the death of a voodoo priestess is murder when she dies in the island's local school just hours after predicting her own death. Richard learns of an affair that took place years earlier in the school leading to the disappearance of a woman, and believes that the victim has a connection to the missing woman. He turns his attention to Nicholas, the prime suspect and Fidel's old principal, who was involved in the disappearance of the woman, but Nicholas has an alibi, leading Richard to question whether he is being set up or not.","thumbnail":"http://127.0.0.1:8090/images/dip33.png"},{"id":4,"season":"1","episode":"4","title":"Missing a Body","detective":"Detective Inspector Richard Poole","victim":"Lucas Talbot","culprit":"Patrick Knight","cause":"Gun shot","description":"Megan Talbot walks into Saint Marie's police station covered in blood, and confesses to the murder of her husband, Lucas. Lucas's body is initially nowhere to be found, but then a local boat crew hoist his body from the sea. Richard fails to believe Megan is behind his death, and as he interrogates Lucas's friends, his reasons to suspect 1 of them is the killer rises.","thumbnail":"http://127.0.0.1:8090/images/ni.png"}
]